app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"  WHERE "albums"."user_id" = 1
---
  def index
    @albums = Album.where(:user_id => current_user.id )

INSERT INTO "albums" ("caption", "created_at", "description", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["caption", "album 1"], ["created_at", "2015-03-05 06:29:48.847476"], ["description", "testing 1"], ["updated_at", "2015-03-05 06:29:48.847476"], ["user_id", 1]]
---
  def create
    @album = Album.new(album_params)
    @album.save