app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"  WHERE "pictures"."album_id" IS NULL
---
  def index

    @albumID = session[:albumID]


    @pictures = Picture.where(:album_id => @albumID)

INSERT INTO "pictures" ("album_id", "caption", "content_type", "created_at", "description", "height", "updated_at", "user_id", "width") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @picture = Picture.new(picture_params)
    @picture.save

UPDATE "pictures" SET "description" = $1, "updated_at" = $2 WHERE "pictures"."id" = 13  [["description", "picture5 added by abc and updating"], ["updated_at", "2015-03-05 08:14:19.929268"]]
---
  def update
    @picture.update(picture_params)